app/controllers/members_controller.rb

  def index
    @pagy, @members = if params[:name]
                          pagy(Member.where('name LIKE ?', "%#{params[:name]}%"), items: 15)
                      else
                        pagy(Member.all, items: 15)
---
SELECT "members".* FROM "members" WHERE (lower(name) LIKE '%nguyen%') LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT "members".* FROM "members"

  def show
    if(Receipt.maximum("number") == nil)
      @new_receipt_number = 0
    else
      @new_receipt_number = Receipt.maximum("number") + 1 ;
    end
    @pagy, @receipts = pagy(@member.receipts.all.order(number: :desc), items: 6);
---
SELECT "receipts".* FROM "receipts" WHERE "receipts"."member_id" = ? LIMIT ? OFFSET ?  [["member_id", 1], ["LIMIT", 1], ["OFFSET", 0]]
SELECT MAX("receipts"."number") FROM "receipts"

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ha Nguyen"], ["address", "537 Polson Ave, Winnipeg, MB, R2W 0P1"], ["phone", "204 558 4030"], ["created_at", "2019-10-21 22:48:28.003999"], ["updated_at", "2019-10-21 22:48:28.003999"]]

  def update
    respond_to do |format|
      if @member.update(member_params)
---
UPDATE "members" SET "phone" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["phone", "741-384-5717"], ["updated_at", "2020-02-17 17:18:08.493550"], ["id", 3]]

  def destroy
    @member.destroy
---
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 7]]