app/controllers/receipts_controller.rb

  def create
    @receipt = Receipt.new(receipt_params)

    respond_to do |format|
      if @receipt.save
---
INSERT INTO "receipts" ("number", "donation_year", "amount", "description", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", 201822], ["donation_year", 2018], ["amount", 300.89], ["description", ""], ["member_id", 7], ["created_at", "2019-10-19 02:56:51.236803"], ["updated_at", "2019-10-19 02:56:51.236803"]]

  def update
    respond_to do |format|
      if @receipt.update(receipt_params)
---
UPDATE "receipts" SET "amount" = ?, "updated_at" = ? WHERE "receipts"."id" = ?  [["amount", 10000.57], ["updated_at", "2019-10-18 03:10:29.944664"], ["id", 1]]

  def destroy
    @receipt.destroy
---
DELETE FROM "receipts" WHERE "receipts"."id" = ?  [["id", 4]]

    def set_receipt
      @receipt = Receipt.find(params[:id])
---
SELECT "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]