app/controllers/receipts_controller.rb

  def index
    @pagy, @receipts = if params[:member_name]
                  @all_receipt = []
                  @members = Member.where('lower(name) Like ?', "%#{params[:member_name].downcase}%" )
                  if(@members.size >= 1)
                    pagy(@members.first.receipts.all.order(number: :desc), items: 15)
                  else
                    pagy(Receipt.where('member_id = 0'))
                  end

              else
                pagy(Receipt.all.order(number: :desc), items: 15)

              end
     @years = Receipt.order(donation_year: :desc).distinct.pluck(:donation_year)
     @number_of_receipt = Hash.new
     @total_amount_each_year_array= Hash.new
     @years.each {
        |year| @year_receipts = Receipt.where(:donation_year => year )
        @total_amount_each_year =  @year_receipts.map(&:amount).sum
        @total_receipts_each_year = @year_receipts.count
---
SELECT "members".* FROM "members" WHERE (name Like '%ha%') ORDER BY "members"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE (name Like '%ha%')
SELECT COUNT(*) FROM "members" WHERE (lower(name) Like '%ha%')
SELECT "receipts".* FROM "receipts" WHERE "receipts"."member_id" = ? ORDER BY "receipts"."number" DESC LIMIT ? OFFSET ?  [["member_id", 1], ["LIMIT", 7], ["OFFSET", 0]]
SELECT "receipts".* FROM "receipts" WHERE "receipts"."member_id" = ?  [["member_id", 1]]
SELECT DISTINCT "receipts"."donation_year" FROM "receipts" ORDER BY "receipts"."donation_year" DESC
SELECT "receipts".* FROM "receipts" ORDER BY "receipts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "receipts".* FROM "receipts" WHERE "receipts"."donation_year" = ?  [["donation_year", 2018]]
SELECT COUNT(*) FROM "receipts" WHERE "receipts"."donation_year" = ?  [["donation_year", 2018]]

  def show
    @receipt = Receipt.find(params[:id])
---
SELECT "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]

  def create
    @receipt = Receipt.new(receipt_params)

    respond_to do |format|
      if @receipt.save
---
INSERT INTO "receipts" ("number", "donation_year", "amount", "description", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", 201822], ["donation_year", 2018], ["amount", 3434.0], ["description", ""], ["member_id", 1], ["created_at", "2019-10-21 22:24:20.536845"], ["updated_at", "2019-10-21 22:24:20.536845"]]

  def update
    respond_to do |format|

      if @receipt.update(receipt_params)
---
UPDATE "receipts" SET "donation_year" = ?, "amount" = ?, "description" = ?, "updated_at" = ? WHERE "receipts"."id" = ?  [["donation_year", 2019], ["amount", 500.0], ["description", ""], ["updated_at", "2020-02-17 18:33:29.861597"], ["id", 27]]

  def destroy
    @receipt.destroy
---
DELETE FROM "receipts" WHERE "receipts"."id" = ?  [["id", 1]]

    def set_receipt
      @receipt = Receipt.find(params[:id])
---
SELECT "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]